GopalSaraf/Practicals/PSDL/include/proc/pic18f55k42.inc
// Register: CCDPD
#define CCDPD CCDPD
CCDPD                                    equ 03A78h
// bitfield definitions
CCDPD_CCDPD0_POSN                        equ 0000h
CCDPD_CCDPD0_POSITION                    equ 0000h
CCDPD_CCDPD0_SIZE                        equ 0001h
CCDPD_CCDPD0_LENGTH                      equ 0001h
CCDPD_CCDPD0_MASK                        equ 0001h
CCDPD_CCDPD1_POSN                        equ 0001h
CCDPD_CCDPD1_POSITION                    equ 0001h
CCDPD_CCDPD1_SIZE                        equ 0001h
CCDPD_CCDPD1_LENGTH                      equ 0001h
CCDPD_CCDPD1_MASK                        equ 0002h
CCDPD_CCDPD2_POSN                        equ 0002h
CCDPD_CCDPD2_POSITION                    equ 0002h
CCDPD_CCDPD2_SIZE                        equ 0001h
CCDPD_CCDPD2_LENGTH                      equ 0001h
CCDPD_CCDPD2_MASK                        equ 0004h
CCDPD_CCDPD3_POSN                        equ 0003h
CCDPD_CCDPD3_POSITION                    equ 0003h
CCDPD_CCDPD3_SIZE                        equ 0001h
CCDPD_CCDPD3_LENGTH                      equ 0001h
CCDPD_CCDPD3_MASK                        equ 0008h
CCDPD_CCDPD4_POSN                        equ 0004h
CCDPD_CCDPD4_POSITION                    equ 0004h
CCDPD_CCDPD4_SIZE                        equ 0001h
CCDPD_CCDPD4_LENGTH                      equ 0001h
CCDPD_CCDPD4_MASK                        equ 0010h
CCDPD_CCDPD5_POSN                        equ 0005h
CCDPD_CCDPD5_POSITION                    equ 0005h
CCDPD_CCDPD5_SIZE                        equ 0001h
CCDPD_CCDPD5_LENGTH                      equ 0001h
CCDPD_CCDPD5_MASK                        equ 0020h
CCDPD_CCDPD6_POSN                        equ 0006h
CCDPD_CCDPD6_POSITION                    equ 0006h
CCDPD_CCDPD6_SIZE                        equ 0001h
CCDPD_CCDPD6_LENGTH                      equ 0001h
CCDPD_CCDPD6_MASK                        equ 0040h
CCDPD_CCDPD7_POSN                        equ 0007h
CCDPD_CCDPD7_POSITION                    equ 0007h
CCDPD_CCDPD7_SIZE                        equ 0001h
CCDPD_CCDPD7_LENGTH                      equ 0001h
CCDPD_CCDPD7_MASK                        equ 0080h

// Register: CCDND
#define CCDND CCDND
CCDND                                    equ 03A79h
// bitfield definitions
CCDND_CCDND0_POSN                        equ 0000h
CCDND_CCDND0_POSITION                    equ 0000h
CCDND_CCDND0_SIZE                        equ 0001h
CCDND_CCDND0_LENGTH                      equ 0001h
CCDND_CCDND0_MASK                        equ 0001h
CCDND_CCDND1_POSN                        equ 0001h
CCDND_CCDND1_POSITION                    equ 0001h
CCDND_CCDND1_SIZE                        equ 0001h
CCDND_CCDND1_LENGTH                      equ 0001h
CCDND_CCDND1_MASK                        equ 0002h
CCDND_CCDND2_POSN                        equ 0002h
CCDND_CCDND2_POSITION                    equ 0002h
CCDND_CCDND2_SIZE                        equ 0001h
CCDND_CCDND2_LENGTH                      equ 0001h
CCDND_CCDND2_MASK                        equ 0004h
CCDND_CCDND3_POSN                        equ 0003h
CCDND_CCDND3_POSITION                    equ 0003h
CCDND_CCDND3_SIZE                        equ 0001h
CCDND_CCDND3_LENGTH                      equ 0001h
CCDND_CCDND3_MASK                        equ 0008h
CCDND_CCDND4_POSN                        equ 0004h
CCDND_CCDND4_POSITION                    equ 0004h
CCDND_CCDND4_SIZE                        equ 0001h
CCDND_CCDND4_LENGTH                      equ 0001h
CCDND_CCDND4_MASK                        equ 0010h
CCDND_CCDND5_POSN                        equ 0005h
CCDND_CCDND5_POSITION                    equ 0005h
CCDND_CCDND5_SIZE                        equ 0001h
CCDND_CCDND5_LENGTH                      equ 0001h
CCDND_CCDND5_MASK                        equ 0020h
CCDND_CCDND6_POSN                        equ 0006h
CCDND_CCDND6_POSITION                    equ 0006h
CCDND_CCDND6_SIZE                        equ 0001h
CCDND_CCDND6_LENGTH                      equ 0001h
CCDND_CCDND6_MASK                        equ 0040h
CCDND_CCDND7_POSN                        equ 0007h
CCDND_CCDND7_POSITION                    equ 0007h
CCDND_CCDND7_SIZE                        equ 0001h
CCDND_CCDND7_LENGTH                      equ 0001h
CCDND_CCDND7_MASK                        equ 0080h

// Register: RD0I2C
#define RD0I2C RD0I2C
RD0I2C                                   equ 03A7Ah
// bitfield definitions
RD0I2C_TH_POSN                           equ 0000h
RD0I2C_TH_POSITION                       equ 0000h
RD0I2C_TH_SIZE                           equ 0002h
RD0I2C_TH_LENGTH                         equ 0002h
RD0I2C_TH_MASK                           equ 0003h
RD0I2C_PU_POSN                           equ 0004h
RD0I2C_PU_POSITION                       equ 0004h
RD0I2C_PU_SIZE                           equ 0002h
RD0I2C_PU_LENGTH                         equ 0002h
RD0I2C_PU_MASK                           equ 0030h
RD0I2C_SLEW_POSN                         equ 0006h
RD0I2C_SLEW_POSITION                     equ 0006h
RD0I2C_SLEW_SIZE                         equ 0001h
RD0I2C_SLEW_LENGTH                       equ 0001h
RD0I2C_SLEW_MASK                         equ 0040h
RD0I2C_TH0_POSN                          equ 0000h
RD0I2C_TH0_POSITION                      equ 0000h
RD0I2C_TH0_SIZE                          equ 0001h
RD0I2C_TH0_LENGTH                        equ 0001h
RD0I2C_TH0_MASK                          equ 0001h
RD0I2C_TH1_POSN                          equ 0001h
RD0I2C_TH1_POSITION                      equ 0001h
RD0I2C_TH1_SIZE                          equ 0001h
RD0I2C_TH1_LENGTH                        equ 0001h
RD0I2C_TH1_MASK                          equ 0002h
RD0I2C_PU0_POSN                          equ 0004h
RD0I2C_PU0_POSITION                      equ 0004h
RD0I2C_PU0_SIZE                          equ 0001h
RD0I2C_PU0_LENGTH                        equ 0001h
RD0I2C_PU0_MASK                          equ 0010h
RD0I2C_PU1_POSN                          equ 0005h
RD0I2C_PU1_POSITION                      equ 0005h
RD0I2C_PU1_SIZE                          equ 0001h
RD0I2C_PU1_LENGTH                        equ 0001h
RD0I2C_PU1_MASK                          equ 0020h
RD0I2C_I2CTH_POSN                        equ 0000h
RD0I2C_I2CTH_POSITION                    equ 0000h
RD0I2C_I2CTH_SIZE                        equ 0002h
RD0I2C_I2CTH_LENGTH                      equ 0002h
RD0I2C_I2CTH_MASK                        equ 0003h
RD0I2C_I2CPU_POSN                        equ 0004h
RD0I2C_I2CPU_POSITION                    equ 0004h
RD0I2C_I2CPU_SIZE                        equ 0002h
RD0I2C_I2CPU_LENGTH                      equ 0002h
RD0I2C_I2CPU_MASK                        equ 0030h
RD0I2C_I2CSLEW_POSN                      equ 0006h
RD0I2C_I2CSLEW_POSITION                  equ 0006h
RD0I2C_I2CSLEW_SIZE                      equ 0001h
RD0I2C_I2CSLEW_LENGTH                    equ 0001h
RD0I2C_I2CSLEW_MASK                      equ 0040h
RD0I2C_I2CTH0_POSN                       equ 0000h
RD0I2C_I2CTH0_POSITION                   equ 0000h
RD0I2C_I2CTH0_SIZE                       equ 0001h
RD0I2C_I2CTH0_LENGTH                     equ 0001h
RD0I2C_I2CTH0_MASK                       equ 0001h
RD0I2C_I2CTH1_POSN                       equ 0001h
RD0I2C_I2CTH1_POSITION                   equ 0001h
RD0I2C_I2CTH1_SIZE                       equ 0001h
RD0I2C_I2CTH1_LENGTH                     equ 0001h
RD0I2C_I2CTH1_MASK                       equ 0002h
RD0I2C_I2CPU0_POSN                       equ 0004h
RD0I2C_I2CPU0_POSITION                   equ 0004h
RD0I2C_I2CPU0_SIZE                       equ 0001h
RD0I2C_I2CPU0_LENGTH                     equ 0001h
RD0I2C_I2CPU0_MASK                       equ 0010h
RD0I2C_I2CPU1_POSN                       equ 0005h
RD0I2C_I2CPU1_POSITION                   equ 0005h
RD0I2C_I2CPU1_SIZE                       equ 0001h
RD0I2C_I2CPU1_LENGTH                     equ 0001h
RD0I2C_I2CPU1_MASK                       equ 0020h

// Register: RD1I2C
#define RD1I2C RD1I2C
RD1I2C                                   equ 03A7Bh
// bitfield definitions
RD1I2C_TH_POSN                           equ 0000h
RD1I2C_TH_POSITION                       equ 0000h
RD1I2C_TH_SIZE                           equ 0002h
RD1I2C_TH_LENGTH                         equ 0002h
RD1I2C_TH_MASK                           equ 0003h
RD1I2C_PU_POSN                           equ 0004h
RD1I2C_PU_POSITION                       equ 0004h
RD1I2C_PU_SIZE                           equ 0002h
RD1I2C_PU_LENGTH                         equ 0002h
RD1I2C_PU_MASK                           equ 0030h
RD1I2C_SLEW_POSN                         equ 0006h
RD1I2C_SLEW_POSITION                     equ 0006h
RD1I2C_SLEW_SIZE                         equ 0001h
RD1I2C_SLEW_LENGTH                       equ 0001h
RD1I2C_SLEW_MASK                         equ 0040h
RD1I2C_TH0_POSN                          equ 0000h
RD1I2C_TH0_POSITION                      equ 0000h
RD1I2C_TH0_SIZE                          equ 0001h
RD1I2C_TH0_LENGTH                        equ 0001h
RD1I2C_TH0_MASK                          equ 0001h
RD1I2C_TH1_POSN                          equ 0001h
RD1I2C_TH1_POSITION                      equ 0001h
RD1I2C_TH1_SIZE                          equ 0001h
RD1I2C_TH1_LENGTH                        equ 0001h
RD1I2C_TH1_MASK                          equ 0002h
RD1I2C_PU0_POSN                          equ 0004h
RD1I2C_PU0_POSITION                      equ 0004h
RD1I2C_PU0_SIZE                          equ 0001h
RD1I2C_PU0_LENGTH                        equ 0001h
RD1I2C_PU0_MASK                          equ 0010h
RD1I2C_PU1_POSN                          equ 0005h
RD1I2C_PU1_POSITION                      equ 0005h
RD1I2C_PU1_SIZE                          equ 0001h
RD1I2C_PU1_LENGTH                        equ 0001h
RD1I2C_PU1_MASK                          equ 0020h
RD1I2C_I2CTH_POSN                        equ 0000h
RD1I2C_I2CTH_POSITION                    equ 0000h
RD1I2C_I2CTH_SIZE                        equ 0002h
RD1I2C_I2CTH_LENGTH                      equ 0002h
RD1I2C_I2CTH_MASK                        equ 0003h
RD1I2C_I2CPU_POSN                        equ 0004h
RD1I2C_I2CPU_POSITION                    equ 0004h
RD1I2C_I2CPU_SIZE                        equ 0002h
RD1I2C_I2CPU_LENGTH                      equ 0002h
RD1I2C_I2CPU_MASK                        equ 0030h
RD1I2C_I2CSLEW_POSN                      equ 0006h
RD1I2C_I2CSLEW_POSITION                  equ 0006h
RD1I2C_I2CSLEW_SIZE                      equ 0001h
RD1I2C_I2CSLEW_LENGTH                    equ 0001h
RD1I2C_I2CSLEW_MASK                      equ 0040h
RD1I2C_I2CTH0_POSN                       equ 0000h
RD1I2C_I2CTH0_POSITION                   equ 0000h
RD1I2C_I2CTH0_SIZE                       equ 0001h
RD1I2C_I2CTH0_LENGTH                     equ 0001h
RD1I2C_I2CTH0_MASK                       equ 0001h
RD1I2C_I2CTH1_POSN                       equ 0001h
RD1I2C_I2CTH1_POSITION                   equ 0001h
RD1I2C_I2CTH1_SIZE                       equ 0001h
RD1I2C_I2CTH1_LENGTH                     equ 0001h
RD1I2C_I2CTH1_MASK                       equ 0002h
RD1I2C_I2CPU0_POSN                       equ 0004h
RD1I2C_I2CPU0_POSITION                   equ 0004h
RD1I2C_I2CPU0_SIZE                       equ 0001h
RD1I2C_I2CPU0_LENGTH                     equ 0001h
RD1I2C_I2CPU0_MASK                       equ 0010h
RD1I2C_I2CPU1_POSN                       equ 0005h
RD1I2C_I2CPU1_POSITION                   equ 0005h
RD1I2C_I2CPU1_SIZE                       equ 0001h
RD1I2C_I2CPU1_LENGTH                     equ 0001h
RD1I2C_I2CPU1_MASK                       equ 0020h

