GopalSaraf/Practicals/PSDL/include/proc/pic18f55k42.inc
// Register: CCDPF
#define CCDPF CCDPF
CCDPF                                    equ 03A98h
// bitfield definitions
CCDPF_CCDPF0_POSN                        equ 0000h
CCDPF_CCDPF0_POSITION                    equ 0000h
CCDPF_CCDPF0_SIZE                        equ 0001h
CCDPF_CCDPF0_LENGTH                      equ 0001h
CCDPF_CCDPF0_MASK                        equ 0001h
CCDPF_CCDPF1_POSN                        equ 0001h
CCDPF_CCDPF1_POSITION                    equ 0001h
CCDPF_CCDPF1_SIZE                        equ 0001h
CCDPF_CCDPF1_LENGTH                      equ 0001h
CCDPF_CCDPF1_MASK                        equ 0002h
CCDPF_CCDPF2_POSN                        equ 0002h
CCDPF_CCDPF2_POSITION                    equ 0002h
CCDPF_CCDPF2_SIZE                        equ 0001h
CCDPF_CCDPF2_LENGTH                      equ 0001h
CCDPF_CCDPF2_MASK                        equ 0004h
CCDPF_CCDPF3_POSN                        equ 0003h
CCDPF_CCDPF3_POSITION                    equ 0003h
CCDPF_CCDPF3_SIZE                        equ 0001h
CCDPF_CCDPF3_LENGTH                      equ 0001h
CCDPF_CCDPF3_MASK                        equ 0008h
CCDPF_CCDPF4_POSN                        equ 0004h
CCDPF_CCDPF4_POSITION                    equ 0004h
CCDPF_CCDPF4_SIZE                        equ 0001h
CCDPF_CCDPF4_LENGTH                      equ 0001h
CCDPF_CCDPF4_MASK                        equ 0010h
CCDPF_CCDPF5_POSN                        equ 0005h
CCDPF_CCDPF5_POSITION                    equ 0005h
CCDPF_CCDPF5_SIZE                        equ 0001h
CCDPF_CCDPF5_LENGTH                      equ 0001h
CCDPF_CCDPF5_MASK                        equ 0020h
CCDPF_CCDPF6_POSN                        equ 0006h
CCDPF_CCDPF6_POSITION                    equ 0006h
CCDPF_CCDPF6_SIZE                        equ 0001h
CCDPF_CCDPF6_LENGTH                      equ 0001h
CCDPF_CCDPF6_MASK                        equ 0040h
CCDPF_CCDPF7_POSN                        equ 0007h
CCDPF_CCDPF7_POSITION                    equ 0007h
CCDPF_CCDPF7_SIZE                        equ 0001h
CCDPF_CCDPF7_LENGTH                      equ 0001h
CCDPF_CCDPF7_MASK                        equ 0080h

// Register: CCDNF
#define CCDNF CCDNF
CCDNF                                    equ 03A99h
// bitfield definitions
CCDNF_CCDNF0_POSN                        equ 0000h
CCDNF_CCDNF0_POSITION                    equ 0000h
CCDNF_CCDNF0_SIZE                        equ 0001h
CCDNF_CCDNF0_LENGTH                      equ 0001h
CCDNF_CCDNF0_MASK                        equ 0001h
CCDNF_CCDNF1_POSN                        equ 0001h
CCDNF_CCDNF1_POSITION                    equ 0001h
CCDNF_CCDNF1_SIZE                        equ 0001h
CCDNF_CCDNF1_LENGTH                      equ 0001h
CCDNF_CCDNF1_MASK                        equ 0002h
CCDNF_CCDNF2_POSN                        equ 0002h
CCDNF_CCDNF2_POSITION                    equ 0002h
CCDNF_CCDNF2_SIZE                        equ 0001h
CCDNF_CCDNF2_LENGTH                      equ 0001h
CCDNF_CCDNF2_MASK                        equ 0004h
CCDNF_CCDNF3_POSN                        equ 0003h
CCDNF_CCDNF3_POSITION                    equ 0003h
CCDNF_CCDNF3_SIZE                        equ 0001h
CCDNF_CCDNF3_LENGTH                      equ 0001h
CCDNF_CCDNF3_MASK                        equ 0008h
CCDNF_CCDNF4_POSN                        equ 0004h
CCDNF_CCDNF4_POSITION                    equ 0004h
CCDNF_CCDNF4_SIZE                        equ 0001h
CCDNF_CCDNF4_LENGTH                      equ 0001h
CCDNF_CCDNF4_MASK                        equ 0010h
CCDNF_CCDNF5_POSN                        equ 0005h
CCDNF_CCDNF5_POSITION                    equ 0005h
CCDNF_CCDNF5_SIZE                        equ 0001h
CCDNF_CCDNF5_LENGTH                      equ 0001h
CCDNF_CCDNF5_MASK                        equ 0020h
CCDNF_CCDNF6_POSN                        equ 0006h
CCDNF_CCDNF6_POSITION                    equ 0006h
CCDNF_CCDNF6_SIZE                        equ 0001h
CCDNF_CCDNF6_LENGTH                      equ 0001h
CCDNF_CCDNF6_MASK                        equ 0040h
CCDNF_CCDNF7_POSN                        equ 0007h
CCDNF_CCDNF7_POSITION                    equ 0007h
CCDNF_CCDNF7_SIZE                        equ 0001h
CCDNF_CCDNF7_LENGTH                      equ 0001h
CCDNF_CCDNF7_MASK                        equ 0080h

// Register: CCDCON
#define CCDCON CCDCON
CCDCON                                   equ 03ABEh
// bitfield definitions
CCDCON_DS_POSN                           equ 0000h
CCDCON_DS_POSITION                       equ 0000h
CCDCON_DS_SIZE                           equ 0002h
CCDCON_DS_LENGTH                         equ 0002h
CCDCON_DS_MASK                           equ 0003h
CCDCON_EN_POSN                           equ 0007h
CCDCON_EN_POSITION                       equ 0007h
CCDCON_EN_SIZE                           equ 0001h
CCDCON_EN_LENGTH                         equ 0001h
CCDCON_EN_MASK                           equ 0080h
CCDCON_CCDS_POSN                         equ 0000h
CCDCON_CCDS_POSITION                     equ 0000h
CCDCON_CCDS_SIZE                         equ 0002h
CCDCON_CCDS_LENGTH                       equ 0002h
CCDCON_CCDS_MASK                         equ 0003h
CCDCON_CCDEN_POSN                        equ 0007h
CCDCON_CCDEN_POSITION                    equ 0007h
CCDCON_CCDEN_SIZE                        equ 0001h
CCDCON_CCDEN_LENGTH                      equ 0001h
CCDCON_CCDEN_MASK                        equ 0080h
CCDCON_SEL0_POSN                         equ 0000h
CCDCON_SEL0_POSITION                     equ 0000h
CCDCON_SEL0_SIZE                         equ 0001h
CCDCON_SEL0_LENGTH                       equ 0001h
CCDCON_SEL0_MASK                         equ 0001h
CCDCON_SEL1_POSN                         equ 0001h
CCDCON_SEL1_POSITION                     equ 0001h
CCDCON_SEL1_SIZE                         equ 0001h
CCDCON_SEL1_LENGTH                       equ 0001h
CCDCON_SEL1_MASK                         equ 0002h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 03ABFh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

