GopalSaraf/Practicals/PSDL/include/proc/pic18f55k42.inc
// Register: MD1CON1
#define MD1CON1 MD1CON1
MD1CON1                                  equ 03CFBh
// bitfield definitions
MD1CON1_CLSYNC_POSN                      equ 0000h
MD1CON1_CLSYNC_POSITION                  equ 0000h
MD1CON1_CLSYNC_SIZE                      equ 0001h
MD1CON1_CLSYNC_LENGTH                    equ 0001h
MD1CON1_CLSYNC_MASK                      equ 0001h
MD1CON1_CLPOL_POSN                       equ 0001h
MD1CON1_CLPOL_POSITION                   equ 0001h
MD1CON1_CLPOL_SIZE                       equ 0001h
MD1CON1_CLPOL_LENGTH                     equ 0001h
MD1CON1_CLPOL_MASK                       equ 0002h
MD1CON1_CHSYNC_POSN                      equ 0004h
MD1CON1_CHSYNC_POSITION                  equ 0004h
MD1CON1_CHSYNC_SIZE                      equ 0001h
MD1CON1_CHSYNC_LENGTH                    equ 0001h
MD1CON1_CHSYNC_MASK                      equ 0010h
MD1CON1_CHPOL_POSN                       equ 0005h
MD1CON1_CHPOL_POSITION                   equ 0005h
MD1CON1_CHPOL_SIZE                       equ 0001h
MD1CON1_CHPOL_LENGTH                     equ 0001h
MD1CON1_CHPOL_MASK                       equ 0020h
MD1CON1_MD1CLSYNC_POSN                   equ 0000h
MD1CON1_MD1CLSYNC_POSITION               equ 0000h
MD1CON1_MD1CLSYNC_SIZE                   equ 0001h
MD1CON1_MD1CLSYNC_LENGTH                 equ 0001h
MD1CON1_MD1CLSYNC_MASK                   equ 0001h
MD1CON1_MD1CLPOL_POSN                    equ 0001h
MD1CON1_MD1CLPOL_POSITION                equ 0001h
MD1CON1_MD1CLPOL_SIZE                    equ 0001h
MD1CON1_MD1CLPOL_LENGTH                  equ 0001h
MD1CON1_MD1CLPOL_MASK                    equ 0002h
MD1CON1_MD1CHSYNC_POSN                   equ 0004h
MD1CON1_MD1CHSYNC_POSITION               equ 0004h
MD1CON1_MD1CHSYNC_SIZE                   equ 0001h
MD1CON1_MD1CHSYNC_LENGTH                 equ 0001h
MD1CON1_MD1CHSYNC_MASK                   equ 0010h
MD1CON1_MD1CHPOL_POSN                    equ 0005h
MD1CON1_MD1CHPOL_POSITION                equ 0005h
MD1CON1_MD1CHPOL_SIZE                    equ 0001h
MD1CON1_MD1CHPOL_LENGTH                  equ 0001h
MD1CON1_MD1CHPOL_MASK                    equ 0020h

// Register: MD1SRC
#define MD1SRC MD1SRC
MD1SRC                                   equ 03CFCh
// bitfield definitions
MD1SRC_MS_POSN                           equ 0000h
MD1SRC_MS_POSITION                       equ 0000h
MD1SRC_MS_SIZE                           equ 0005h
MD1SRC_MS_LENGTH                         equ 0005h
MD1SRC_MS_MASK                           equ 001Fh
MD1SRC_MS0_POSN                          equ 0000h
MD1SRC_MS0_POSITION                      equ 0000h
MD1SRC_MS0_SIZE                          equ 0001h
MD1SRC_MS0_LENGTH                        equ 0001h
MD1SRC_MS0_MASK                          equ 0001h
MD1SRC_MS1_POSN                          equ 0001h
MD1SRC_MS1_POSITION                      equ 0001h
MD1SRC_MS1_SIZE                          equ 0001h
MD1SRC_MS1_LENGTH                        equ 0001h
MD1SRC_MS1_MASK                          equ 0002h
MD1SRC_MS2_POSN                          equ 0002h
MD1SRC_MS2_POSITION                      equ 0002h
MD1SRC_MS2_SIZE                          equ 0001h
MD1SRC_MS2_LENGTH                        equ 0001h
MD1SRC_MS2_MASK                          equ 0004h
MD1SRC_MS3_POSN                          equ 0003h
MD1SRC_MS3_POSITION                      equ 0003h
MD1SRC_MS3_SIZE                          equ 0001h
MD1SRC_MS3_LENGTH                        equ 0001h
MD1SRC_MS3_MASK                          equ 0008h
MD1SRC_MS4_POSN                          equ 0004h
MD1SRC_MS4_POSITION                      equ 0004h
MD1SRC_MS4_SIZE                          equ 0001h
MD1SRC_MS4_LENGTH                        equ 0001h
MD1SRC_MS4_MASK                          equ 0010h
MD1SRC_MD1MS_POSN                        equ 0000h
MD1SRC_MD1MS_POSITION                    equ 0000h
MD1SRC_MD1MS_SIZE                        equ 0005h
MD1SRC_MD1MS_LENGTH                      equ 0005h
MD1SRC_MD1MS_MASK                        equ 001Fh
MD1SRC_MD1MS0_POSN                       equ 0000h
MD1SRC_MD1MS0_POSITION                   equ 0000h
MD1SRC_MD1MS0_SIZE                       equ 0001h
MD1SRC_MD1MS0_LENGTH                     equ 0001h
MD1SRC_MD1MS0_MASK                       equ 0001h
MD1SRC_MD1MS1_POSN                       equ 0001h
MD1SRC_MD1MS1_POSITION                   equ 0001h
MD1SRC_MD1MS1_SIZE                       equ 0001h
MD1SRC_MD1MS1_LENGTH                     equ 0001h
MD1SRC_MD1MS1_MASK                       equ 0002h
MD1SRC_MD1MS2_POSN                       equ 0002h
MD1SRC_MD1MS2_POSITION                   equ 0002h
MD1SRC_MD1MS2_SIZE                       equ 0001h
MD1SRC_MD1MS2_LENGTH                     equ 0001h
MD1SRC_MD1MS2_MASK                       equ 0004h
MD1SRC_MD1MS3_POSN                       equ 0003h
MD1SRC_MD1MS3_POSITION                   equ 0003h
MD1SRC_MD1MS3_SIZE                       equ 0001h
MD1SRC_MD1MS3_LENGTH                     equ 0001h
MD1SRC_MD1MS3_MASK                       equ 0008h
MD1SRC_MD1MS4_POSN                       equ 0004h
MD1SRC_MD1MS4_POSITION                   equ 0004h
MD1SRC_MD1MS4_SIZE                       equ 0001h
MD1SRC_MD1MS4_LENGTH                     equ 0001h
MD1SRC_MD1MS4_MASK                       equ 0010h

// Register: MD1CARL
#define MD1CARL MD1CARL
MD1CARL                                  equ 03CFDh
// bitfield definitions
MD1CARL_CL_POSN                          equ 0000h
MD1CARL_CL_POSITION                      equ 0000h
MD1CARL_CL_SIZE                          equ 0005h
MD1CARL_CL_LENGTH                        equ 0005h
MD1CARL_CL_MASK                          equ 001Fh
MD1CARL_CL0_POSN                         equ 0000h
MD1CARL_CL0_POSITION                     equ 0000h
MD1CARL_CL0_SIZE                         equ 0001h
MD1CARL_CL0_LENGTH                       equ 0001h
MD1CARL_CL0_MASK                         equ 0001h
MD1CARL_CL1_POSN                         equ 0001h
MD1CARL_CL1_POSITION                     equ 0001h
MD1CARL_CL1_SIZE                         equ 0001h
MD1CARL_CL1_LENGTH                       equ 0001h
MD1CARL_CL1_MASK                         equ 0002h
MD1CARL_CL2_POSN                         equ 0002h
MD1CARL_CL2_POSITION                     equ 0002h
MD1CARL_CL2_SIZE                         equ 0001h
MD1CARL_CL2_LENGTH                       equ 0001h
MD1CARL_CL2_MASK                         equ 0004h
MD1CARL_CL3_POSN                         equ 0003h
MD1CARL_CL3_POSITION                     equ 0003h
MD1CARL_CL3_SIZE                         equ 0001h
MD1CARL_CL3_LENGTH                       equ 0001h
MD1CARL_CL3_MASK                         equ 0008h
MD1CARL_CL4_POSN                         equ 0004h
MD1CARL_CL4_POSITION                     equ 0004h
MD1CARL_CL4_SIZE                         equ 0001h
MD1CARL_CL4_LENGTH                       equ 0001h
MD1CARL_CL4_MASK                         equ 0010h
MD1CARL_MD1CL_POSN                       equ 0000h
MD1CARL_MD1CL_POSITION                   equ 0000h
MD1CARL_MD1CL_SIZE                       equ 0005h
MD1CARL_MD1CL_LENGTH                     equ 0005h
MD1CARL_MD1CL_MASK                       equ 001Fh
MD1CARL_MD1CL0_POSN                      equ 0000h
MD1CARL_MD1CL0_POSITION                  equ 0000h
MD1CARL_MD1CL0_SIZE                      equ 0001h
MD1CARL_MD1CL0_LENGTH                    equ 0001h
MD1CARL_MD1CL0_MASK                      equ 0001h
MD1CARL_MD1CL1_POSN                      equ 0001h
MD1CARL_MD1CL1_POSITION                  equ 0001h
MD1CARL_MD1CL1_SIZE                      equ 0001h
MD1CARL_MD1CL1_LENGTH                    equ 0001h
MD1CARL_MD1CL1_MASK                      equ 0002h
MD1CARL_MD1CL2_POSN                      equ 0002h
MD1CARL_MD1CL2_POSITION                  equ 0002h
MD1CARL_MD1CL2_SIZE                      equ 0001h
MD1CARL_MD1CL2_LENGTH                    equ 0001h
MD1CARL_MD1CL2_MASK                      equ 0004h
MD1CARL_MD1CL3_POSN                      equ 0003h
MD1CARL_MD1CL3_POSITION                  equ 0003h
MD1CARL_MD1CL3_SIZE                      equ 0001h
MD1CARL_MD1CL3_LENGTH                    equ 0001h
MD1CARL_MD1CL3_MASK                      equ 0008h
MD1CARL_MD1CL4_POSN                      equ 0004h
MD1CARL_MD1CL4_POSITION                  equ 0004h
MD1CARL_MD1CL4_SIZE                      equ 0001h
MD1CARL_MD1CL4_LENGTH                    equ 0001h
MD1CARL_MD1CL4_MASK                      equ 0010h

// Register: MD1CARH
#define MD1CARH MD1CARH
MD1CARH                                  equ 03CFEh
// bitfield definitions
MD1CARH_CH_POSN                          equ 0000h
MD1CARH_CH_POSITION                      equ 0000h
MD1CARH_CH_SIZE                          equ 0005h
MD1CARH_CH_LENGTH                        equ 0005h
MD1CARH_CH_MASK                          equ 001Fh
MD1CARH_CH0_POSN                         equ 0000h
MD1CARH_CH0_POSITION                     equ 0000h
MD1CARH_CH0_SIZE                         equ 0001h
MD1CARH_CH0_LENGTH                       equ 0001h
MD1CARH_CH0_MASK                         equ 0001h
MD1CARH_CH1_POSN                         equ 0001h
MD1CARH_CH1_POSITION                     equ 0001h
MD1CARH_CH1_SIZE                         equ 0001h
MD1CARH_CH1_LENGTH                       equ 0001h
MD1CARH_CH1_MASK                         equ 0002h
MD1CARH_CH2_POSN                         equ 0002h
MD1CARH_CH2_POSITION                     equ 0002h
MD1CARH_CH2_SIZE                         equ 0001h
MD1CARH_CH2_LENGTH                       equ 0001h
MD1CARH_CH2_MASK                         equ 0004h
MD1CARH_CH3_POSN                         equ 0003h
MD1CARH_CH3_POSITION                     equ 0003h
MD1CARH_CH3_SIZE                         equ 0001h
MD1CARH_CH3_LENGTH                       equ 0001h
MD1CARH_CH3_MASK                         equ 0008h
MD1CARH_CH4_POSN                         equ 0004h
MD1CARH_CH4_POSITION                     equ 0004h
MD1CARH_CH4_SIZE                         equ 0001h
MD1CARH_CH4_LENGTH                       equ 0001h
MD1CARH_CH4_MASK                         equ 0010h
MD1CARH_MD1CH_POSN                       equ 0000h
MD1CARH_MD1CH_POSITION                   equ 0000h
MD1CARH_MD1CH_SIZE                       equ 0005h
MD1CARH_MD1CH_LENGTH                     equ 0005h
MD1CARH_MD1CH_MASK                       equ 001Fh
MD1CARH_MD1CH0_POSN                      equ 0000h
MD1CARH_MD1CH0_POSITION                  equ 0000h
MD1CARH_MD1CH0_SIZE                      equ 0001h
MD1CARH_MD1CH0_LENGTH                    equ 0001h
MD1CARH_MD1CH0_MASK                      equ 0001h
MD1CARH_MD1CH1_POSN                      equ 0001h
MD1CARH_MD1CH1_POSITION                  equ 0001h
MD1CARH_MD1CH1_SIZE                      equ 0001h
MD1CARH_MD1CH1_LENGTH                    equ 0001h
MD1CARH_MD1CH1_MASK                      equ 0002h
MD1CARH_MD1CH2_POSN                      equ 0002h
MD1CARH_MD1CH2_POSITION                  equ 0002h
MD1CARH_MD1CH2_SIZE                      equ 0001h
MD1CARH_MD1CH2_LENGTH                    equ 0001h
MD1CARH_MD1CH2_MASK                      equ 0004h
MD1CARH_MD1CH3_POSN                      equ 0003h
MD1CARH_MD1CH3_POSITION                  equ 0003h
MD1CARH_MD1CH3_SIZE                      equ 0001h
MD1CARH_MD1CH3_LENGTH                    equ 0001h
MD1CARH_MD1CH3_MASK                      equ 0008h
MD1CARH_MD1CH4_POSN                      equ 0004h
MD1CARH_MD1CH4_POSITION                  equ 0004h
MD1CARH_MD1CH4_SIZE                      equ 0001h
MD1CARH_MD1CH4_LENGTH                    equ 0001h
MD1CARH_MD1CH4_MASK                      equ 0010h

// Register: SPI1RXB
#define SPI1RXB SPI1RXB
SPI1RXB                                  equ 03D10h
// bitfield definitions
SPI1RXB_RXB_POSN                         equ 0000h
SPI1RXB_RXB_POSITION                     equ 0000h
SPI1RXB_RXB_SIZE                         equ 0008h
SPI1RXB_RXB_LENGTH                       equ 0008h
SPI1RXB_RXB_MASK                         equ 00FFh
SPI1RXB_RXB0_POSN                        equ 0000h
SPI1RXB_RXB0_POSITION                    equ 0000h
SPI1RXB_RXB0_SIZE                        equ 0001h
SPI1RXB_RXB0_LENGTH                      equ 0001h
SPI1RXB_RXB0_MASK                        equ 0001h
SPI1RXB_RXB1_POSN                        equ 0001h
SPI1RXB_RXB1_POSITION                    equ 0001h
SPI1RXB_RXB1_SIZE                        equ 0001h
SPI1RXB_RXB1_LENGTH                      equ 0001h
SPI1RXB_RXB1_MASK                        equ 0002h
SPI1RXB_RXB2_POSN                        equ 0002h
SPI1RXB_RXB2_POSITION                    equ 0002h
SPI1RXB_RXB2_SIZE                        equ 0001h
SPI1RXB_RXB2_LENGTH                      equ 0001h
SPI1RXB_RXB2_MASK                        equ 0004h
SPI1RXB_RXB3_POSN                        equ 0003h
SPI1RXB_RXB3_POSITION                    equ 0003h
SPI1RXB_RXB3_SIZE                        equ 0001h
SPI1RXB_RXB3_LENGTH                      equ 0001h
SPI1RXB_RXB3_MASK                        equ 0008h
SPI1RXB_RXB4_POSN                        equ 0004h
SPI1RXB_RXB4_POSITION                    equ 0004h
SPI1RXB_RXB4_SIZE                        equ 0001h
SPI1RXB_RXB4_LENGTH                      equ 0001h
SPI1RXB_RXB4_MASK                        equ 0010h
SPI1RXB_RXB5_POSN                        equ 0005h
SPI1RXB_RXB5_POSITION                    equ 0005h
SPI1RXB_RXB5_SIZE                        equ 0001h
SPI1RXB_RXB5_LENGTH                      equ 0001h
SPI1RXB_RXB5_MASK                        equ 0020h
SPI1RXB_RXB6_POSN                        equ 0006h
SPI1RXB_RXB6_POSITION                    equ 0006h
SPI1RXB_RXB6_SIZE                        equ 0001h
SPI1RXB_RXB6_LENGTH                      equ 0001h
SPI1RXB_RXB6_MASK                        equ 0040h
SPI1RXB_RXB7_POSN                        equ 0007h
SPI1RXB_RXB7_POSITION                    equ 0007h
SPI1RXB_RXB7_SIZE                        equ 0001h
SPI1RXB_RXB7_LENGTH                      equ 0001h
SPI1RXB_RXB7_MASK                        equ 0080h

// Register: SPI1TXB
#define SPI1TXB SPI1TXB
SPI1TXB                                  equ 03D11h
// bitfield definitions
SPI1TXB_TXB_POSN                         equ 0000h
SPI1TXB_TXB_POSITION                     equ 0000h
SPI1TXB_TXB_SIZE                         equ 0008h
SPI1TXB_TXB_LENGTH                       equ 0008h
SPI1TXB_TXB_MASK                         equ 00FFh
SPI1TXB_TXB0_POSN                        equ 0000h
SPI1TXB_TXB0_POSITION                    equ 0000h
SPI1TXB_TXB0_SIZE                        equ 0001h
SPI1TXB_TXB0_LENGTH                      equ 0001h
SPI1TXB_TXB0_MASK                        equ 0001h
SPI1TXB_TXB1_POSN                        equ 0001h
SPI1TXB_TXB1_POSITION                    equ 0001h
SPI1TXB_TXB1_SIZE                        equ 0001h
SPI1TXB_TXB1_LENGTH                      equ 0001h
SPI1TXB_TXB1_MASK                        equ 0002h
SPI1TXB_TXB2_POSN                        equ 0002h
SPI1TXB_TXB2_POSITION                    equ 0002h
SPI1TXB_TXB2_SIZE                        equ 0001h
SPI1TXB_TXB2_LENGTH                      equ 0001h
SPI1TXB_TXB2_MASK                        equ 0004h
SPI1TXB_TXB3_POSN                        equ 0003h
SPI1TXB_TXB3_POSITION                    equ 0003h
SPI1TXB_TXB3_SIZE                        equ 0001h
SPI1TXB_TXB3_LENGTH                      equ 0001h
SPI1TXB_TXB3_MASK                        equ 0008h
SPI1TXB_TXB4_POSN                        equ 0004h
SPI1TXB_TXB4_POSITION                    equ 0004h
SPI1TXB_TXB4_SIZE                        equ 0001h
SPI1TXB_TXB4_LENGTH                      equ 0001h
SPI1TXB_TXB4_MASK                        equ 0010h
SPI1TXB_TXB5_POSN                        equ 0005h
SPI1TXB_TXB5_POSITION                    equ 0005h
SPI1TXB_TXB5_SIZE                        equ 0001h
SPI1TXB_TXB5_LENGTH                      equ 0001h
SPI1TXB_TXB5_MASK                        equ 0020h
SPI1TXB_TXB6_POSN                        equ 0006h
SPI1TXB_TXB6_POSITION                    equ 0006h
SPI1TXB_TXB6_SIZE                        equ 0001h
SPI1TXB_TXB6_LENGTH                      equ 0001h
SPI1TXB_TXB6_MASK                        equ 0040h
SPI1TXB_TXB7_POSN                        equ 0007h
SPI1TXB_TXB7_POSITION                    equ 0007h
SPI1TXB_TXB7_SIZE                        equ 0001h
SPI1TXB_TXB7_LENGTH                      equ 0001h
SPI1TXB_TXB7_MASK                        equ 0080h

// Register: SPI1TCNT
#define SPI1TCNT SPI1TCNT
SPI1TCNT                                 equ 03D12h

// Register: SPI1TCNTL
#define SPI1TCNTL SPI1TCNTL
SPI1TCNTL                                equ 03D12h
// bitfield definitions
SPI1TCNTL_TCNTL_POSN                     equ 0000h
SPI1TCNTL_TCNTL_POSITION                 equ 0000h
SPI1TCNTL_TCNTL_SIZE                     equ 0008h
SPI1TCNTL_TCNTL_LENGTH                   equ 0008h
SPI1TCNTL_TCNTL_MASK                     equ 00FFh

