GopalSaraf/Practicals/PSDL/include/proc/pic18f55k42.inc
// Register: I2C2CON2
#define I2C2CON2 I2C2CON2
I2C2CON2                                 equ 03D5Fh
// bitfield definitions
I2C2CON2_BFRET_POSN                      equ 0000h
I2C2CON2_BFRET_POSITION                  equ 0000h
I2C2CON2_BFRET_SIZE                      equ 0002h
I2C2CON2_BFRET_LENGTH                    equ 0002h
I2C2CON2_BFRET_MASK                      equ 0003h
I2C2CON2_SDAHT_POSN                      equ 0002h
I2C2CON2_SDAHT_POSITION                  equ 0002h
I2C2CON2_SDAHT_SIZE                      equ 0002h
I2C2CON2_SDAHT_LENGTH                    equ 0002h
I2C2CON2_SDAHT_MASK                      equ 000Ch
I2C2CON2_ABD_POSN                        equ 0004h
I2C2CON2_ABD_POSITION                    equ 0004h
I2C2CON2_ABD_SIZE                        equ 0001h
I2C2CON2_ABD_LENGTH                      equ 0001h
I2C2CON2_ABD_MASK                        equ 0010h
I2C2CON2_FME_POSN                        equ 0005h
I2C2CON2_FME_POSITION                    equ 0005h
I2C2CON2_FME_SIZE                        equ 0001h
I2C2CON2_FME_LENGTH                      equ 0001h
I2C2CON2_FME_MASK                        equ 0020h
I2C2CON2_GCEN_POSN                       equ 0006h
I2C2CON2_GCEN_POSITION                   equ 0006h
I2C2CON2_GCEN_SIZE                       equ 0001h
I2C2CON2_GCEN_LENGTH                     equ 0001h
I2C2CON2_GCEN_MASK                       equ 0040h
I2C2CON2_ACNT_POSN                       equ 0007h
I2C2CON2_ACNT_POSITION                   equ 0007h
I2C2CON2_ACNT_SIZE                       equ 0001h
I2C2CON2_ACNT_LENGTH                     equ 0001h
I2C2CON2_ACNT_MASK                       equ 0080h
I2C2CON2_BFRET0_POSN                     equ 0000h
I2C2CON2_BFRET0_POSITION                 equ 0000h
I2C2CON2_BFRET0_SIZE                     equ 0001h
I2C2CON2_BFRET0_LENGTH                   equ 0001h
I2C2CON2_BFRET0_MASK                     equ 0001h
I2C2CON2_BFRET1_POSN                     equ 0001h
I2C2CON2_BFRET1_POSITION                 equ 0001h
I2C2CON2_BFRET1_SIZE                     equ 0001h
I2C2CON2_BFRET1_LENGTH                   equ 0001h
I2C2CON2_BFRET1_MASK                     equ 0002h
I2C2CON2_SDAHT0_POSN                     equ 0002h
I2C2CON2_SDAHT0_POSITION                 equ 0002h
I2C2CON2_SDAHT0_SIZE                     equ 0001h
I2C2CON2_SDAHT0_LENGTH                   equ 0001h
I2C2CON2_SDAHT0_MASK                     equ 0004h
I2C2CON2_SDAHT1_POSN                     equ 0003h
I2C2CON2_SDAHT1_POSITION                 equ 0003h
I2C2CON2_SDAHT1_SIZE                     equ 0001h
I2C2CON2_SDAHT1_LENGTH                   equ 0001h
I2C2CON2_SDAHT1_MASK                     equ 0008h

// Register: I2C2ERR
#define I2C2ERR I2C2ERR
I2C2ERR                                  equ 03D60h
// bitfield definitions
I2C2ERR_NACKIE_POSN                      equ 0000h
I2C2ERR_NACKIE_POSITION                  equ 0000h
I2C2ERR_NACKIE_SIZE                      equ 0001h
I2C2ERR_NACKIE_LENGTH                    equ 0001h
I2C2ERR_NACKIE_MASK                      equ 0001h
I2C2ERR_BCLIE_POSN                       equ 0001h
I2C2ERR_BCLIE_POSITION                   equ 0001h
I2C2ERR_BCLIE_SIZE                       equ 0001h
I2C2ERR_BCLIE_LENGTH                     equ 0001h
I2C2ERR_BCLIE_MASK                       equ 0002h
I2C2ERR_BTOIE_POSN                       equ 0002h
I2C2ERR_BTOIE_POSITION                   equ 0002h
I2C2ERR_BTOIE_SIZE                       equ 0001h
I2C2ERR_BTOIE_LENGTH                     equ 0001h
I2C2ERR_BTOIE_MASK                       equ 0004h
I2C2ERR_NACKIF_POSN                      equ 0004h
I2C2ERR_NACKIF_POSITION                  equ 0004h
I2C2ERR_NACKIF_SIZE                      equ 0001h
I2C2ERR_NACKIF_LENGTH                    equ 0001h
I2C2ERR_NACKIF_MASK                      equ 0010h
I2C2ERR_BCLIF_POSN                       equ 0005h
I2C2ERR_BCLIF_POSITION                   equ 0005h
I2C2ERR_BCLIF_SIZE                       equ 0001h
I2C2ERR_BCLIF_LENGTH                     equ 0001h
I2C2ERR_BCLIF_MASK                       equ 0020h
I2C2ERR_BTOIF_POSN                       equ 0006h
I2C2ERR_BTOIF_POSITION                   equ 0006h
I2C2ERR_BTOIF_SIZE                       equ 0001h
I2C2ERR_BTOIF_LENGTH                     equ 0001h
I2C2ERR_BTOIF_MASK                       equ 0040h
I2C2ERR_NACK2IE_POSN                     equ 0000h
I2C2ERR_NACK2IE_POSITION                 equ 0000h
I2C2ERR_NACK2IE_SIZE                     equ 0001h
I2C2ERR_NACK2IE_LENGTH                   equ 0001h
I2C2ERR_NACK2IE_MASK                     equ 0001h
I2C2ERR_BCL2IE_POSN                      equ 0001h
I2C2ERR_BCL2IE_POSITION                  equ 0001h
I2C2ERR_BCL2IE_SIZE                      equ 0001h
I2C2ERR_BCL2IE_LENGTH                    equ 0001h
I2C2ERR_BCL2IE_MASK                      equ 0002h
I2C2ERR_BTO2IE_POSN                      equ 0002h
I2C2ERR_BTO2IE_POSITION                  equ 0002h
I2C2ERR_BTO2IE_SIZE                      equ 0001h
I2C2ERR_BTO2IE_LENGTH                    equ 0001h
I2C2ERR_BTO2IE_MASK                      equ 0004h
I2C2ERR_NACK2IF_POSN                     equ 0004h
I2C2ERR_NACK2IF_POSITION                 equ 0004h
I2C2ERR_NACK2IF_SIZE                     equ 0001h
I2C2ERR_NACK2IF_LENGTH                   equ 0001h
I2C2ERR_NACK2IF_MASK                     equ 0010h
I2C2ERR_BCL2IF_POSN                      equ 0005h
I2C2ERR_BCL2IF_POSITION                  equ 0005h
I2C2ERR_BCL2IF_SIZE                      equ 0001h
I2C2ERR_BCL2IF_LENGTH                    equ 0001h
I2C2ERR_BCL2IF_MASK                      equ 0020h
I2C2ERR_BTO2IF_POSN                      equ 0006h
I2C2ERR_BTO2IF_POSITION                  equ 0006h
I2C2ERR_BTO2IF_SIZE                      equ 0001h
I2C2ERR_BTO2IF_LENGTH                    equ 0001h
I2C2ERR_BTO2IF_MASK                      equ 0040h

// Register: I2C2STAT0
#define I2C2STAT0 I2C2STAT0
I2C2STAT0                                equ 03D61h
// bitfield definitions
I2C2STAT0_D_POSN                         equ 0003h
I2C2STAT0_D_POSITION                     equ 0003h
I2C2STAT0_D_SIZE                         equ 0001h
I2C2STAT0_D_LENGTH                       equ 0001h
I2C2STAT0_D_MASK                         equ 0008h
I2C2STAT0_R_POSN                         equ 0004h
I2C2STAT0_R_POSITION                     equ 0004h
I2C2STAT0_R_SIZE                         equ 0001h
I2C2STAT0_R_LENGTH                       equ 0001h
I2C2STAT0_R_MASK                         equ 0010h
I2C2STAT0_MMA_POSN                       equ 0005h
I2C2STAT0_MMA_POSITION                   equ 0005h
I2C2STAT0_MMA_SIZE                       equ 0001h
I2C2STAT0_MMA_LENGTH                     equ 0001h
I2C2STAT0_MMA_MASK                       equ 0020h
I2C2STAT0_SMA_POSN                       equ 0006h
I2C2STAT0_SMA_POSITION                   equ 0006h
I2C2STAT0_SMA_SIZE                       equ 0001h
I2C2STAT0_SMA_LENGTH                     equ 0001h
I2C2STAT0_SMA_MASK                       equ 0040h
I2C2STAT0_BFRE_POSN                      equ 0007h
I2C2STAT0_BFRE_POSITION                  equ 0007h
I2C2STAT0_BFRE_SIZE                      equ 0001h
I2C2STAT0_BFRE_LENGTH                    equ 0001h
I2C2STAT0_BFRE_MASK                      equ 0080h
I2C2STAT0_DATA_POSN                      equ 0003h
I2C2STAT0_DATA_POSITION                  equ 0003h
I2C2STAT0_DATA_SIZE                      equ 0001h
I2C2STAT0_DATA_LENGTH                    equ 0001h
I2C2STAT0_DATA_MASK                      equ 0008h
I2C2STAT0_READ_POSN                      equ 0004h
I2C2STAT0_READ_POSITION                  equ 0004h
I2C2STAT0_READ_SIZE                      equ 0001h
I2C2STAT0_READ_LENGTH                    equ 0001h
I2C2STAT0_READ_MASK                      equ 0010h
I2C2STAT0_NOT_ADDRESS_POSN               equ 0003h
I2C2STAT0_NOT_ADDRESS_POSITION           equ 0003h
I2C2STAT0_NOT_ADDRESS_SIZE               equ 0001h
I2C2STAT0_NOT_ADDRESS_LENGTH             equ 0001h
I2C2STAT0_NOT_ADDRESS_MASK               equ 0008h
I2C2STAT0_NOT_WRITE_POSN                 equ 0004h
I2C2STAT0_NOT_WRITE_POSITION             equ 0004h
I2C2STAT0_NOT_WRITE_SIZE                 equ 0001h
I2C2STAT0_NOT_WRITE_LENGTH               equ 0001h
I2C2STAT0_NOT_WRITE_MASK                 equ 0010h
I2C2STAT0_NOT_A_POSN                     equ 0003h
I2C2STAT0_NOT_A_POSITION                 equ 0003h
I2C2STAT0_NOT_A_SIZE                     equ 0001h
I2C2STAT0_NOT_A_LENGTH                   equ 0001h
I2C2STAT0_NOT_A_MASK                     equ 0008h
I2C2STAT0_NOT_W_POSN                     equ 0004h
I2C2STAT0_NOT_W_POSITION                 equ 0004h
I2C2STAT0_NOT_W_SIZE                     equ 0001h
I2C2STAT0_NOT_W_LENGTH                   equ 0001h
I2C2STAT0_NOT_W_MASK                     equ 0010h

// Register: I2C2STAT1
#define I2C2STAT1 I2C2STAT1
I2C2STAT1                                equ 03D62h
// bitfield definitions
I2C2STAT1_RXBF_POSN                      equ 0000h
I2C2STAT1_RXBF_POSITION                  equ 0000h
I2C2STAT1_RXBF_SIZE                      equ 0001h
I2C2STAT1_RXBF_LENGTH                    equ 0001h
I2C2STAT1_RXBF_MASK                      equ 0001h
I2C2STAT1_CLRBF_POSN                     equ 0002h
I2C2STAT1_CLRBF_POSITION                 equ 0002h
I2C2STAT1_CLRBF_SIZE                     equ 0001h
I2C2STAT1_CLRBF_LENGTH                   equ 0001h
I2C2STAT1_CLRBF_MASK                     equ 0004h
I2C2STAT1_RXRE_POSN                      equ 0003h
I2C2STAT1_RXRE_POSITION                  equ 0003h
I2C2STAT1_RXRE_SIZE                      equ 0001h
I2C2STAT1_RXRE_LENGTH                    equ 0001h
I2C2STAT1_RXRE_MASK                      equ 0008h
I2C2STAT1_TXBE_POSN                      equ 0005h
I2C2STAT1_TXBE_POSITION                  equ 0005h
I2C2STAT1_TXBE_SIZE                      equ 0001h
I2C2STAT1_TXBE_LENGTH                    equ 0001h
I2C2STAT1_TXBE_MASK                      equ 0020h
I2C2STAT1_TXWE_POSN                      equ 0007h
I2C2STAT1_TXWE_POSITION                  equ 0007h
I2C2STAT1_TXWE_SIZE                      equ 0001h
I2C2STAT1_TXWE_LENGTH                    equ 0001h
I2C2STAT1_TXWE_MASK                      equ 0080h

// Register: I2C2PIR
#define I2C2PIR I2C2PIR
I2C2PIR                                  equ 03D63h
// bitfield definitions
I2C2PIR_SCIF_POSN                        equ 0000h
I2C2PIR_SCIF_POSITION                    equ 0000h
I2C2PIR_SCIF_SIZE                        equ 0001h
I2C2PIR_SCIF_LENGTH                      equ 0001h
I2C2PIR_SCIF_MASK                        equ 0001h
I2C2PIR_RSCIF_POSN                       equ 0001h
I2C2PIR_RSCIF_POSITION                   equ 0001h
I2C2PIR_RSCIF_SIZE                       equ 0001h
I2C2PIR_RSCIF_LENGTH                     equ 0001h
I2C2PIR_RSCIF_MASK                       equ 0002h
I2C2PIR_PCIF_POSN                        equ 0002h
I2C2PIR_PCIF_POSITION                    equ 0002h
I2C2PIR_PCIF_SIZE                        equ 0001h
I2C2PIR_PCIF_LENGTH                      equ 0001h
I2C2PIR_PCIF_MASK                        equ 0004h
I2C2PIR_ADRIF_POSN                       equ 0003h
I2C2PIR_ADRIF_POSITION                   equ 0003h
I2C2PIR_ADRIF_SIZE                       equ 0001h
I2C2PIR_ADRIF_LENGTH                     equ 0001h
I2C2PIR_ADRIF_MASK                       equ 0008h
I2C2PIR_WRIF_POSN                        equ 0004h
I2C2PIR_WRIF_POSITION                    equ 0004h
I2C2PIR_WRIF_SIZE                        equ 0001h
I2C2PIR_WRIF_LENGTH                      equ 0001h
I2C2PIR_WRIF_MASK                        equ 0010h
I2C2PIR_ACKTIF_POSN                      equ 0006h
I2C2PIR_ACKTIF_POSITION                  equ 0006h
I2C2PIR_ACKTIF_SIZE                      equ 0001h
I2C2PIR_ACKTIF_LENGTH                    equ 0001h
I2C2PIR_ACKTIF_MASK                      equ 0040h
I2C2PIR_CNTIF_POSN                       equ 0007h
I2C2PIR_CNTIF_POSITION                   equ 0007h
I2C2PIR_CNTIF_SIZE                       equ 0001h
I2C2PIR_CNTIF_LENGTH                     equ 0001h
I2C2PIR_CNTIF_MASK                       equ 0080h
I2C2PIR_SC2IF_POSN                       equ 0000h
I2C2PIR_SC2IF_POSITION                   equ 0000h
I2C2PIR_SC2IF_SIZE                       equ 0001h
I2C2PIR_SC2IF_LENGTH                     equ 0001h
I2C2PIR_SC2IF_MASK                       equ 0001h
I2C2PIR_RSC2IF_POSN                      equ 0001h
I2C2PIR_RSC2IF_POSITION                  equ 0001h
I2C2PIR_RSC2IF_SIZE                      equ 0001h
I2C2PIR_RSC2IF_LENGTH                    equ 0001h
I2C2PIR_RSC2IF_MASK                      equ 0002h
I2C2PIR_PC2IF_POSN                       equ 0002h
I2C2PIR_PC2IF_POSITION                   equ 0002h
I2C2PIR_PC2IF_SIZE                       equ 0001h
I2C2PIR_PC2IF_LENGTH                     equ 0001h
I2C2PIR_PC2IF_MASK                       equ 0004h
I2C2PIR_ADR2IF_POSN                      equ 0003h
I2C2PIR_ADR2IF_POSITION                  equ 0003h
I2C2PIR_ADR2IF_SIZE                      equ 0001h
I2C2PIR_ADR2IF_LENGTH                    equ 0001h
I2C2PIR_ADR2IF_MASK                      equ 0008h
I2C2PIR_WR2IF_POSN                       equ 0004h
I2C2PIR_WR2IF_POSITION                   equ 0004h
I2C2PIR_WR2IF_SIZE                       equ 0001h
I2C2PIR_WR2IF_LENGTH                     equ 0001h
I2C2PIR_WR2IF_MASK                       equ 0010h
I2C2PIR_ACKT2IF_POSN                     equ 0006h
I2C2PIR_ACKT2IF_POSITION                 equ 0006h
I2C2PIR_ACKT2IF_SIZE                     equ 0001h
I2C2PIR_ACKT2IF_LENGTH                   equ 0001h
I2C2PIR_ACKT2IF_MASK                     equ 0040h
I2C2PIR_CNT2IF_POSN                      equ 0007h
I2C2PIR_CNT2IF_POSITION                  equ 0007h
I2C2PIR_CNT2IF_SIZE                      equ 0001h
I2C2PIR_CNT2IF_LENGTH                    equ 0001h
I2C2PIR_CNT2IF_MASK                      equ 0080h

// Register: I2C2PIE
#define I2C2PIE I2C2PIE
I2C2PIE                                  equ 03D64h
// bitfield definitions
I2C2PIE_SCIE_POSN                        equ 0000h
I2C2PIE_SCIE_POSITION                    equ 0000h
I2C2PIE_SCIE_SIZE                        equ 0001h
I2C2PIE_SCIE_LENGTH                      equ 0001h
I2C2PIE_SCIE_MASK                        equ 0001h
I2C2PIE_RSCIE_POSN                       equ 0001h
I2C2PIE_RSCIE_POSITION                   equ 0001h
I2C2PIE_RSCIE_SIZE                       equ 0001h
I2C2PIE_RSCIE_LENGTH                     equ 0001h
I2C2PIE_RSCIE_MASK                       equ 0002h
I2C2PIE_PCIE_POSN                        equ 0002h
I2C2PIE_PCIE_POSITION                    equ 0002h
I2C2PIE_PCIE_SIZE                        equ 0001h
I2C2PIE_PCIE_LENGTH                      equ 0001h
I2C2PIE_PCIE_MASK                        equ 0004h
I2C2PIE_ADRIE_POSN                       equ 0003h
I2C2PIE_ADRIE_POSITION                   equ 0003h
I2C2PIE_ADRIE_SIZE                       equ 0001h
I2C2PIE_ADRIE_LENGTH                     equ 0001h
I2C2PIE_ADRIE_MASK                       equ 0008h
I2C2PIE_WRIE_POSN                        equ 0004h
I2C2PIE_WRIE_POSITION                    equ 0004h
I2C2PIE_WRIE_SIZE                        equ 0001h
I2C2PIE_WRIE_LENGTH                      equ 0001h
I2C2PIE_WRIE_MASK                        equ 0010h
I2C2PIE_ACKTIE_POSN                      equ 0006h
I2C2PIE_ACKTIE_POSITION                  equ 0006h
I2C2PIE_ACKTIE_SIZE                      equ 0001h
I2C2PIE_ACKTIE_LENGTH                    equ 0001h
I2C2PIE_ACKTIE_MASK                      equ 0040h
I2C2PIE_CNTIE_POSN                       equ 0007h
I2C2PIE_CNTIE_POSITION                   equ 0007h
I2C2PIE_CNTIE_SIZE                       equ 0001h
I2C2PIE_CNTIE_LENGTH                     equ 0001h
I2C2PIE_CNTIE_MASK                       equ 0080h
I2C2PIE_SC2IE_POSN                       equ 0000h
I2C2PIE_SC2IE_POSITION                   equ 0000h
I2C2PIE_SC2IE_SIZE                       equ 0001h
I2C2PIE_SC2IE_LENGTH                     equ 0001h
I2C2PIE_SC2IE_MASK                       equ 0001h
I2C2PIE_RSC2IE_POSN                      equ 0001h
I2C2PIE_RSC2IE_POSITION                  equ 0001h
I2C2PIE_RSC2IE_SIZE                      equ 0001h
I2C2PIE_RSC2IE_LENGTH                    equ 0001h
I2C2PIE_RSC2IE_MASK                      equ 0002h
I2C2PIE_PC2IE_POSN                       equ 0002h
I2C2PIE_PC2IE_POSITION                   equ 0002h
I2C2PIE_PC2IE_SIZE                       equ 0001h
I2C2PIE_PC2IE_LENGTH                     equ 0001h
I2C2PIE_PC2IE_MASK                       equ 0004h
I2C2PIE_ADR2IE_POSN                      equ 0003h
I2C2PIE_ADR2IE_POSITION                  equ 0003h
I2C2PIE_ADR2IE_SIZE                      equ 0001h
I2C2PIE_ADR2IE_LENGTH                    equ 0001h
I2C2PIE_ADR2IE_MASK                      equ 0008h
I2C2PIE_WR2IE_POSN                       equ 0004h
I2C2PIE_WR2IE_POSITION                   equ 0004h
I2C2PIE_WR2IE_SIZE                       equ 0001h
I2C2PIE_WR2IE_LENGTH                     equ 0001h
I2C2PIE_WR2IE_MASK                       equ 0010h
I2C2PIE_ACKT2IE_POSN                     equ 0006h
I2C2PIE_ACKT2IE_POSITION                 equ 0006h
I2C2PIE_ACKT2IE_SIZE                     equ 0001h
I2C2PIE_ACKT2IE_LENGTH                   equ 0001h
I2C2PIE_ACKT2IE_MASK                     equ 0040h
I2C2PIE_CNT2IE_POSN                      equ 0007h
I2C2PIE_CNT2IE_POSITION                  equ 0007h
I2C2PIE_CNT2IE_SIZE                      equ 0001h
I2C2PIE_CNT2IE_LENGTH                    equ 0001h
I2C2PIE_CNT2IE_MASK                      equ 0080h

// Register: I2C2CLK
#define I2C2CLK I2C2CLK
I2C2CLK                                  equ 03D65h
// bitfield definitions
I2C2CLK_CLK_POSN                         equ 0000h
I2C2CLK_CLK_POSITION                     equ 0000h
I2C2CLK_CLK_SIZE                         equ 0008h
I2C2CLK_CLK_LENGTH                       equ 0008h
I2C2CLK_CLK_MASK                         equ 00FFh
I2C2CLK_I2CCLK_POSN                      equ 0000h
I2C2CLK_I2CCLK_POSITION                  equ 0000h
I2C2CLK_I2CCLK_SIZE                      equ 0008h
I2C2CLK_I2CCLK_LENGTH                    equ 0008h
I2C2CLK_I2CCLK_MASK                      equ 00FFh
I2C2CLK_CLK0_POSN                        equ 0000h
I2C2CLK_CLK0_POSITION                    equ 0000h
I2C2CLK_CLK0_SIZE                        equ 0001h
I2C2CLK_CLK0_LENGTH                      equ 0001h
I2C2CLK_CLK0_MASK                        equ 0001h
I2C2CLK_CLK1_POSN                        equ 0001h
I2C2CLK_CLK1_POSITION                    equ 0001h
I2C2CLK_CLK1_SIZE                        equ 0001h
I2C2CLK_CLK1_LENGTH                      equ 0001h
I2C2CLK_CLK1_MASK                        equ 0002h
I2C2CLK_CLK2_POSN                        equ 0002h
I2C2CLK_CLK2_POSITION                    equ 0002h
I2C2CLK_CLK2_SIZE                        equ 0001h
I2C2CLK_CLK2_LENGTH                      equ 0001h
I2C2CLK_CLK2_MASK                        equ 0004h
I2C2CLK_CLK3_POSN                        equ 0003h
I2C2CLK_CLK3_POSITION                    equ 0003h
I2C2CLK_CLK3_SIZE                        equ 0001h
I2C2CLK_CLK3_LENGTH                      equ 0001h
I2C2CLK_CLK3_MASK                        equ 0008h
I2C2CLK_I2CCLK0_POSN                     equ 0000h
I2C2CLK_I2CCLK0_POSITION                 equ 0000h
I2C2CLK_I2CCLK0_SIZE                     equ 0001h
I2C2CLK_I2CCLK0_LENGTH                   equ 0001h
I2C2CLK_I2CCLK0_MASK                     equ 0001h
I2C2CLK_I2CCLK1_POSN                     equ 0001h
I2C2CLK_I2CCLK1_POSITION                 equ 0001h
I2C2CLK_I2CCLK1_SIZE                     equ 0001h
I2C2CLK_I2CCLK1_LENGTH                   equ 0001h
I2C2CLK_I2CCLK1_MASK                     equ 0002h
I2C2CLK_I2CCLK2_POSN                     equ 0002h
I2C2CLK_I2CCLK2_POSITION                 equ 0002h
I2C2CLK_I2CCLK2_SIZE                     equ 0001h
I2C2CLK_I2CCLK2_LENGTH                   equ 0001h
I2C2CLK_I2CCLK2_MASK                     equ 0004h
I2C2CLK_I2CCLK3_POSN                     equ 0003h
I2C2CLK_I2CCLK3_POSITION                 equ 0003h
I2C2CLK_I2CCLK3_SIZE                     equ 0001h
I2C2CLK_I2CCLK3_LENGTH                   equ 0001h
I2C2CLK_I2CCLK3_MASK                     equ 0008h

// Register: I2C2BTO
#define I2C2BTO I2C2BTO
I2C2BTO                                  equ 03D66h
// bitfield definitions
I2C2BTO_BTO_POSN                         equ 0000h
I2C2BTO_BTO_POSITION                     equ 0000h
I2C2BTO_BTO_SIZE                         equ 0008h
I2C2BTO_BTO_LENGTH                       equ 0008h
I2C2BTO_BTO_MASK                         equ 00FFh
I2C2BTO_I2CBTO_POSN                      equ 0000h
I2C2BTO_I2CBTO_POSITION                  equ 0000h
I2C2BTO_I2CBTO_SIZE                      equ 0008h
I2C2BTO_I2CBTO_LENGTH                    equ 0008h
I2C2BTO_I2CBTO_MASK                      equ 00FFh
I2C2BTO_BTO0_POSN                        equ 0000h
I2C2BTO_BTO0_POSITION                    equ 0000h
I2C2BTO_BTO0_SIZE                        equ 0001h
I2C2BTO_BTO0_LENGTH                      equ 0001h
I2C2BTO_BTO0_MASK                        equ 0001h
I2C2BTO_BTO1_POSN                        equ 0001h
I2C2BTO_BTO1_POSITION                    equ 0001h
I2C2BTO_BTO1_SIZE                        equ 0001h
I2C2BTO_BTO1_LENGTH                      equ 0001h
I2C2BTO_BTO1_MASK                        equ 0002h
I2C2BTO_BTO2_POSN                        equ 0002h
I2C2BTO_BTO2_POSITION                    equ 0002h
I2C2BTO_BTO2_SIZE                        equ 0001h
I2C2BTO_BTO2_LENGTH                      equ 0001h
I2C2BTO_BTO2_MASK                        equ 0004h
I2C2BTO_I2CBTO0_POSN                     equ 0000h
I2C2BTO_I2CBTO0_POSITION                 equ 0000h
I2C2BTO_I2CBTO0_SIZE                     equ 0001h
I2C2BTO_I2CBTO0_LENGTH                   equ 0001h
I2C2BTO_I2CBTO0_MASK                     equ 0001h
I2C2BTO_I2CBTO1_POSN                     equ 0001h
I2C2BTO_I2CBTO1_POSITION                 equ 0001h
I2C2BTO_I2CBTO1_SIZE                     equ 0001h
I2C2BTO_I2CBTO1_LENGTH                   equ 0001h
I2C2BTO_I2CBTO1_MASK                     equ 0002h
I2C2BTO_I2CBTO2_POSN                     equ 0002h
I2C2BTO_I2CBTO2_POSITION                 equ 0002h
I2C2BTO_I2CBTO2_SIZE                     equ 0001h
I2C2BTO_I2CBTO2_LENGTH                   equ 0001h
I2C2BTO_I2CBTO2_MASK                     equ 0004h

// Register: I2C1RXB
#define I2C1RXB I2C1RXB
I2C1RXB                                  equ 03D6Ah
// bitfield definitions
I2C1RXB_RXB_POSN                         equ 0000h
I2C1RXB_RXB_POSITION                     equ 0000h
I2C1RXB_RXB_SIZE                         equ 0008h
I2C1RXB_RXB_LENGTH                       equ 0008h
I2C1RXB_RXB_MASK                         equ 00FFh

// Register: I2C1TXB
#define I2C1TXB I2C1TXB
I2C1TXB                                  equ 03D6Bh
// bitfield definitions
I2C1TXB_TXB_POSN                         equ 0000h
I2C1TXB_TXB_POSITION                     equ 0000h
I2C1TXB_TXB_SIZE                         equ 0008h
I2C1TXB_TXB_LENGTH                       equ 0008h
I2C1TXB_TXB_MASK                         equ 00FFh

