GopalSaraf/Practicals/PSDL/include/proc/pic18f55k42.inc
// Register: I2C1CON2
#define I2C1CON2 I2C1CON2
I2C1CON2                                 equ 03D75h
// bitfield definitions
I2C1CON2_BFRET_POSN                      equ 0000h
I2C1CON2_BFRET_POSITION                  equ 0000h
I2C1CON2_BFRET_SIZE                      equ 0002h
I2C1CON2_BFRET_LENGTH                    equ 0002h
I2C1CON2_BFRET_MASK                      equ 0003h
I2C1CON2_SDAHT_POSN                      equ 0002h
I2C1CON2_SDAHT_POSITION                  equ 0002h
I2C1CON2_SDAHT_SIZE                      equ 0002h
I2C1CON2_SDAHT_LENGTH                    equ 0002h
I2C1CON2_SDAHT_MASK                      equ 000Ch
I2C1CON2_ABD_POSN                        equ 0004h
I2C1CON2_ABD_POSITION                    equ 0004h
I2C1CON2_ABD_SIZE                        equ 0001h
I2C1CON2_ABD_LENGTH                      equ 0001h
I2C1CON2_ABD_MASK                        equ 0010h
I2C1CON2_FME_POSN                        equ 0005h
I2C1CON2_FME_POSITION                    equ 0005h
I2C1CON2_FME_SIZE                        equ 0001h
I2C1CON2_FME_LENGTH                      equ 0001h
I2C1CON2_FME_MASK                        equ 0020h
I2C1CON2_GCEN_POSN                       equ 0006h
I2C1CON2_GCEN_POSITION                   equ 0006h
I2C1CON2_GCEN_SIZE                       equ 0001h
I2C1CON2_GCEN_LENGTH                     equ 0001h
I2C1CON2_GCEN_MASK                       equ 0040h
I2C1CON2_ACNT_POSN                       equ 0007h
I2C1CON2_ACNT_POSITION                   equ 0007h
I2C1CON2_ACNT_SIZE                       equ 0001h
I2C1CON2_ACNT_LENGTH                     equ 0001h
I2C1CON2_ACNT_MASK                       equ 0080h
I2C1CON2_BFRET0_POSN                     equ 0000h
I2C1CON2_BFRET0_POSITION                 equ 0000h
I2C1CON2_BFRET0_SIZE                     equ 0001h
I2C1CON2_BFRET0_LENGTH                   equ 0001h
I2C1CON2_BFRET0_MASK                     equ 0001h
I2C1CON2_BFRET1_POSN                     equ 0001h
I2C1CON2_BFRET1_POSITION                 equ 0001h
I2C1CON2_BFRET1_SIZE                     equ 0001h
I2C1CON2_BFRET1_LENGTH                   equ 0001h
I2C1CON2_BFRET1_MASK                     equ 0002h
I2C1CON2_SDAHT0_POSN                     equ 0002h
I2C1CON2_SDAHT0_POSITION                 equ 0002h
I2C1CON2_SDAHT0_SIZE                     equ 0001h
I2C1CON2_SDAHT0_LENGTH                   equ 0001h
I2C1CON2_SDAHT0_MASK                     equ 0004h
I2C1CON2_SDAHT1_POSN                     equ 0003h
I2C1CON2_SDAHT1_POSITION                 equ 0003h
I2C1CON2_SDAHT1_SIZE                     equ 0001h
I2C1CON2_SDAHT1_LENGTH                   equ 0001h
I2C1CON2_SDAHT1_MASK                     equ 0008h

// Register: I2C1ERR
#define I2C1ERR I2C1ERR
I2C1ERR                                  equ 03D76h
// bitfield definitions
I2C1ERR_NACKIE_POSN                      equ 0000h
I2C1ERR_NACKIE_POSITION                  equ 0000h
I2C1ERR_NACKIE_SIZE                      equ 0001h
I2C1ERR_NACKIE_LENGTH                    equ 0001h
I2C1ERR_NACKIE_MASK                      equ 0001h
I2C1ERR_BCLIE_POSN                       equ 0001h
I2C1ERR_BCLIE_POSITION                   equ 0001h
I2C1ERR_BCLIE_SIZE                       equ 0001h
I2C1ERR_BCLIE_LENGTH                     equ 0001h
I2C1ERR_BCLIE_MASK                       equ 0002h
I2C1ERR_BTOIE_POSN                       equ 0002h
I2C1ERR_BTOIE_POSITION                   equ 0002h
I2C1ERR_BTOIE_SIZE                       equ 0001h
I2C1ERR_BTOIE_LENGTH                     equ 0001h
I2C1ERR_BTOIE_MASK                       equ 0004h
I2C1ERR_NACKIF_POSN                      equ 0004h
I2C1ERR_NACKIF_POSITION                  equ 0004h
I2C1ERR_NACKIF_SIZE                      equ 0001h
I2C1ERR_NACKIF_LENGTH                    equ 0001h
I2C1ERR_NACKIF_MASK                      equ 0010h
I2C1ERR_BCLIF_POSN                       equ 0005h
I2C1ERR_BCLIF_POSITION                   equ 0005h
I2C1ERR_BCLIF_SIZE                       equ 0001h
I2C1ERR_BCLIF_LENGTH                     equ 0001h
I2C1ERR_BCLIF_MASK                       equ 0020h
I2C1ERR_BTOIF_POSN                       equ 0006h
I2C1ERR_BTOIF_POSITION                   equ 0006h
I2C1ERR_BTOIF_SIZE                       equ 0001h
I2C1ERR_BTOIF_LENGTH                     equ 0001h
I2C1ERR_BTOIF_MASK                       equ 0040h
I2C1ERR_NACK1IE_POSN                     equ 0000h
I2C1ERR_NACK1IE_POSITION                 equ 0000h
I2C1ERR_NACK1IE_SIZE                     equ 0001h
I2C1ERR_NACK1IE_LENGTH                   equ 0001h
I2C1ERR_NACK1IE_MASK                     equ 0001h
I2C1ERR_BCL1IE_POSN                      equ 0001h
I2C1ERR_BCL1IE_POSITION                  equ 0001h
I2C1ERR_BCL1IE_SIZE                      equ 0001h
I2C1ERR_BCL1IE_LENGTH                    equ 0001h
I2C1ERR_BCL1IE_MASK                      equ 0002h
I2C1ERR_BTO1IE_POSN                      equ 0002h
I2C1ERR_BTO1IE_POSITION                  equ 0002h
I2C1ERR_BTO1IE_SIZE                      equ 0001h
I2C1ERR_BTO1IE_LENGTH                    equ 0001h
I2C1ERR_BTO1IE_MASK                      equ 0004h
I2C1ERR_NACK1IF_POSN                     equ 0004h
I2C1ERR_NACK1IF_POSITION                 equ 0004h
I2C1ERR_NACK1IF_SIZE                     equ 0001h
I2C1ERR_NACK1IF_LENGTH                   equ 0001h
I2C1ERR_NACK1IF_MASK                     equ 0010h
I2C1ERR_BCL1IF_POSN                      equ 0005h
I2C1ERR_BCL1IF_POSITION                  equ 0005h
I2C1ERR_BCL1IF_SIZE                      equ 0001h
I2C1ERR_BCL1IF_LENGTH                    equ 0001h
I2C1ERR_BCL1IF_MASK                      equ 0020h
I2C1ERR_BTO1IF_POSN                      equ 0006h
I2C1ERR_BTO1IF_POSITION                  equ 0006h
I2C1ERR_BTO1IF_SIZE                      equ 0001h
I2C1ERR_BTO1IF_LENGTH                    equ 0001h
I2C1ERR_BTO1IF_MASK                      equ 0040h

// Register: I2C1STAT0
#define I2C1STAT0 I2C1STAT0
I2C1STAT0                                equ 03D77h
// bitfield definitions
I2C1STAT0_D_POSN                         equ 0003h
I2C1STAT0_D_POSITION                     equ 0003h
I2C1STAT0_D_SIZE                         equ 0001h
I2C1STAT0_D_LENGTH                       equ 0001h
I2C1STAT0_D_MASK                         equ 0008h
I2C1STAT0_R_POSN                         equ 0004h
I2C1STAT0_R_POSITION                     equ 0004h
I2C1STAT0_R_SIZE                         equ 0001h
I2C1STAT0_R_LENGTH                       equ 0001h
I2C1STAT0_R_MASK                         equ 0010h
I2C1STAT0_MMA_POSN                       equ 0005h
I2C1STAT0_MMA_POSITION                   equ 0005h
I2C1STAT0_MMA_SIZE                       equ 0001h
I2C1STAT0_MMA_LENGTH                     equ 0001h
I2C1STAT0_MMA_MASK                       equ 0020h
I2C1STAT0_SMA_POSN                       equ 0006h
I2C1STAT0_SMA_POSITION                   equ 0006h
I2C1STAT0_SMA_SIZE                       equ 0001h
I2C1STAT0_SMA_LENGTH                     equ 0001h
I2C1STAT0_SMA_MASK                       equ 0040h
I2C1STAT0_BFRE_POSN                      equ 0007h
I2C1STAT0_BFRE_POSITION                  equ 0007h
I2C1STAT0_BFRE_SIZE                      equ 0001h
I2C1STAT0_BFRE_LENGTH                    equ 0001h
I2C1STAT0_BFRE_MASK                      equ 0080h
I2C1STAT0_DATA_POSN                      equ 0003h
I2C1STAT0_DATA_POSITION                  equ 0003h
I2C1STAT0_DATA_SIZE                      equ 0001h
I2C1STAT0_DATA_LENGTH                    equ 0001h
I2C1STAT0_DATA_MASK                      equ 0008h
I2C1STAT0_READ_POSN                      equ 0004h
I2C1STAT0_READ_POSITION                  equ 0004h
I2C1STAT0_READ_SIZE                      equ 0001h
I2C1STAT0_READ_LENGTH                    equ 0001h
I2C1STAT0_READ_MASK                      equ 0010h
I2C1STAT0_NOT_ADDRESS_POSN               equ 0003h
I2C1STAT0_NOT_ADDRESS_POSITION           equ 0003h
I2C1STAT0_NOT_ADDRESS_SIZE               equ 0001h
I2C1STAT0_NOT_ADDRESS_LENGTH             equ 0001h
I2C1STAT0_NOT_ADDRESS_MASK               equ 0008h
I2C1STAT0_NOT_WRITE_POSN                 equ 0004h
I2C1STAT0_NOT_WRITE_POSITION             equ 0004h
I2C1STAT0_NOT_WRITE_SIZE                 equ 0001h
I2C1STAT0_NOT_WRITE_LENGTH               equ 0001h
I2C1STAT0_NOT_WRITE_MASK                 equ 0010h
I2C1STAT0_NOT_A_POSN                     equ 0003h
I2C1STAT0_NOT_A_POSITION                 equ 0003h
I2C1STAT0_NOT_A_SIZE                     equ 0001h
I2C1STAT0_NOT_A_LENGTH                   equ 0001h
I2C1STAT0_NOT_A_MASK                     equ 0008h
I2C1STAT0_NOT_W_POSN                     equ 0004h
I2C1STAT0_NOT_W_POSITION                 equ 0004h
I2C1STAT0_NOT_W_SIZE                     equ 0001h
I2C1STAT0_NOT_W_LENGTH                   equ 0001h
I2C1STAT0_NOT_W_MASK                     equ 0010h

